[
  {
    "title": "Universal bitwise function composition from Church numerals in lambda calculus",
    "date": "2025-07-28",
    "excerpt": "Explores mapping Church numerals to arbitrary bitwise function compositions using SK combinators. Introduces binary numerals to generically construct unary and binary bitwise operations, leveraging fixed-point combinators for recursion and a new successor-based conversion method.",
    "tags": [
      "Wolfram",
      "lambda calculus",
      "sk combinator"
    ],
    "type": "external",
    "externalUrl": "https://community.wolfram.com/groups/-/m/t/3520635"
  },
  {
    "title": "Cellular automata generation of 3D printer infill",
    "date": "2025-02-24",
    "excerpt": "Introduces a CA-based method for generating optimized 3D printer infill structures. Implements voxel-based modeling with Marching Cubes to produce STL files, achieving lightness, flexibility, and strength compared to traditional geometric patterns.",
    "tags": [
      "Wolfram",
      "WELP'25",
      "celluar automata"
    ],
    "type": "external",
    "externalUrl": "https://community.wolfram.com/groups/-/m/t/3379925"
  },
  {
    "title": "Constructing combinators for arithmetic and arbitrary-length bitwise operations",
    "date": "2024-07-11",
    "excerpt": "Investigates SK combinators for arithmetic on Church numerals, introducing efficient combinators and a novel construction method for arbitrary-length binary representations supporting bitwise operations. Includes complexity analysis and performance comparisons for arithmetic operations.",
    "tags": [
      "Wolfram",
      "WSRP'24",
      "sk combinator"
    ],
    "type": "external",
    "externalUrl": "https://community.wolfram.com/groups/-/m/t/3216997"
  },
  {
    "id": "first-blog",
    "title": "Mt first blog",
    "subtitle": "This is my first blog",
    "date": "2023-10-14",
    "author": "Austin Jiang",
    "readTime": "10 min",
    "excerpt": "This is my first blog post written in markdown format. Click to read the full article.",
    "tags": [
      "computer-science",
      "turing-machine",
      "photoshop"
    ],
    "type": "markdown",
    "markdownFile": "/blog/first-blog.md"
  }
]